MikroElektronika/core_packages/ARM/gcc_clang/system/src/sam/atsamd09/thirdparty/atsamd09/component/sercom.h
#define SERCOM_SPI_CTRLA_SWRST_Pos            _U_(0)                                               /**< (SERCOM_SPI_CTRLA) Software Reset Position */
#define SERCOM_SPI_CTRLA_SWRST_Msk            (_U_(0x1) << SERCOM_SPI_CTRLA_SWRST_Pos)             /**< (SERCOM_SPI_CTRLA) Software Reset Mask */
#define SERCOM_SPI_CTRLA_SWRST(value)         (SERCOM_SPI_CTRLA_SWRST_Msk & ((value) << SERCOM_SPI_CTRLA_SWRST_Pos))
#define SERCOM_SPI_CTRLA_ENABLE_Pos           _U_(1)                                               /**< (SERCOM_SPI_CTRLA) Enable Position */
#define SERCOM_SPI_CTRLA_ENABLE_Msk           (_U_(0x1) << SERCOM_SPI_CTRLA_ENABLE_Pos)            /**< (SERCOM_SPI_CTRLA) Enable Mask */
#define SERCOM_SPI_CTRLA_ENABLE(value)        (SERCOM_SPI_CTRLA_ENABLE_Msk & ((value) << SERCOM_SPI_CTRLA_ENABLE_Pos))
#define SERCOM_SPI_CTRLA_MODE_Pos             _U_(2)                                               /**< (SERCOM_SPI_CTRLA) Operating Mode Position */
#define SERCOM_SPI_CTRLA_MODE_Msk             (_U_(0x7) << SERCOM_SPI_CTRLA_MODE_Pos)              /**< (SERCOM_SPI_CTRLA) Operating Mode Mask */
#define SERCOM_SPI_CTRLA_MODE(value)          (SERCOM_SPI_CTRLA_MODE_Msk & ((value) << SERCOM_SPI_CTRLA_MODE_Pos))
#define   SERCOM_SPI_CTRLA_MODE_USART_EXT_CLK_Val _U_(0x0)                                             /**< (SERCOM_SPI_CTRLA) USART mode with external clock  */
#define   SERCOM_SPI_CTRLA_MODE_USART_INT_CLK_Val _U_(0x1)                                             /**< (SERCOM_SPI_CTRLA) USART mode with internal clock  */
#define   SERCOM_SPI_CTRLA_MODE_SPI_SLAVE_Val _U_(0x2)                                             /**< (SERCOM_SPI_CTRLA) SPI mode with external clock  */
#define   SERCOM_SPI_CTRLA_MODE_SPI_MASTER_Val _U_(0x3)                                             /**< (SERCOM_SPI_CTRLA) SPI mode with internal clock  */
#define   SERCOM_SPI_CTRLA_MODE_I2C_SLAVE_Val _U_(0x4)                                             /**< (SERCOM_SPI_CTRLA) I2C mode with external clock  */
#define   SERCOM_SPI_CTRLA_MODE_I2C_MASTER_Val _U_(0x5)                                             /**< (SERCOM_SPI_CTRLA) I2C mode with internal clock  */
#define SERCOM_SPI_CTRLA_MODE_USART_EXT_CLK   (SERCOM_SPI_CTRLA_MODE_USART_EXT_CLK_Val << SERCOM_SPI_CTRLA_MODE_Pos) /**< (SERCOM_SPI_CTRLA) USART mode with external clock Position  */
#define SERCOM_SPI_CTRLA_MODE_USART_INT_CLK   (SERCOM_SPI_CTRLA_MODE_USART_INT_CLK_Val << SERCOM_SPI_CTRLA_MODE_Pos) /**< (SERCOM_SPI_CTRLA) USART mode with internal clock Position  */
#define SERCOM_SPI_CTRLA_MODE_SPI_SLAVE       (SERCOM_SPI_CTRLA_MODE_SPI_SLAVE_Val << SERCOM_SPI_CTRLA_MODE_Pos) /**< (SERCOM_SPI_CTRLA) SPI mode with external clock Position  */
#define SERCOM_SPI_CTRLA_MODE_SPI_MASTER      (SERCOM_SPI_CTRLA_MODE_SPI_MASTER_Val << SERCOM_SPI_CTRLA_MODE_Pos) /**< (SERCOM_SPI_CTRLA) SPI mode with internal clock Position  */
#define SERCOM_SPI_CTRLA_MODE_I2C_SLAVE       (SERCOM_SPI_CTRLA_MODE_I2C_SLAVE_Val << SERCOM_SPI_CTRLA_MODE_Pos) /**< (SERCOM_SPI_CTRLA) I2C mode with external clock Position  */
#define SERCOM_SPI_CTRLA_MODE_I2C_MASTER      (SERCOM_SPI_CTRLA_MODE_I2C_MASTER_Val << SERCOM_SPI_CTRLA_MODE_Pos) /**< (SERCOM_SPI_CTRLA) I2C mode with internal clock Position  */
#define SERCOM_SPI_CTRLA_RUNSTDBY_Pos         _U_(7)                                               /**< (SERCOM_SPI_CTRLA) Run during Standby Position */
#define SERCOM_SPI_CTRLA_RUNSTDBY_Msk         (_U_(0x1) << SERCOM_SPI_CTRLA_RUNSTDBY_Pos)          /**< (SERCOM_SPI_CTRLA) Run during Standby Mask */
#define SERCOM_SPI_CTRLA_RUNSTDBY(value)      (SERCOM_SPI_CTRLA_RUNSTDBY_Msk & ((value) << SERCOM_SPI_CTRLA_RUNSTDBY_Pos))
#define SERCOM_SPI_CTRLA_IBON_Pos             _U_(8)                                               /**< (SERCOM_SPI_CTRLA) Immediate Buffer Overflow Notification Position */
#define SERCOM_SPI_CTRLA_IBON_Msk             (_U_(0x1) << SERCOM_SPI_CTRLA_IBON_Pos)              /**< (SERCOM_SPI_CTRLA) Immediate Buffer Overflow Notification Mask */
#define SERCOM_SPI_CTRLA_IBON(value)          (SERCOM_SPI_CTRLA_IBON_Msk & ((value) << SERCOM_SPI_CTRLA_IBON_Pos))
#define SERCOM_SPI_CTRLA_DOPO_Pos             _U_(16)                                              /**< (SERCOM_SPI_CTRLA) Data Out Pinout Position */
#define SERCOM_SPI_CTRLA_DOPO_Msk             (_U_(0x3) << SERCOM_SPI_CTRLA_DOPO_Pos)              /**< (SERCOM_SPI_CTRLA) Data Out Pinout Mask */
#define SERCOM_SPI_CTRLA_DOPO(value)          (SERCOM_SPI_CTRLA_DOPO_Msk & ((value) << SERCOM_SPI_CTRLA_DOPO_Pos))
#define SERCOM_SPI_CTRLA_DIPO_Pos             _U_(20)                                              /**< (SERCOM_SPI_CTRLA) Data In Pinout Position */
#define SERCOM_SPI_CTRLA_DIPO_Msk             (_U_(0x3) << SERCOM_SPI_CTRLA_DIPO_Pos)              /**< (SERCOM_SPI_CTRLA) Data In Pinout Mask */
#define SERCOM_SPI_CTRLA_DIPO(value)          (SERCOM_SPI_CTRLA_DIPO_Msk & ((value) << SERCOM_SPI_CTRLA_DIPO_Pos))
#define SERCOM_SPI_CTRLA_FORM_Pos             _U_(24)                                              /**< (SERCOM_SPI_CTRLA) Frame Format Position */
#define SERCOM_SPI_CTRLA_FORM_Msk             (_U_(0xF) << SERCOM_SPI_CTRLA_FORM_Pos)              /**< (SERCOM_SPI_CTRLA) Frame Format Mask */
#define SERCOM_SPI_CTRLA_FORM(value)          (SERCOM_SPI_CTRLA_FORM_Msk & ((value) << SERCOM_SPI_CTRLA_FORM_Pos))
#define SERCOM_SPI_CTRLA_CPHA_Pos             _U_(28)                                              /**< (SERCOM_SPI_CTRLA) Clock Phase Position */
#define SERCOM_SPI_CTRLA_CPHA_Msk             (_U_(0x1) << SERCOM_SPI_CTRLA_CPHA_Pos)              /**< (SERCOM_SPI_CTRLA) Clock Phase Mask */
#define SERCOM_SPI_CTRLA_CPHA(value)          (SERCOM_SPI_CTRLA_CPHA_Msk & ((value) << SERCOM_SPI_CTRLA_CPHA_Pos))
#define SERCOM_SPI_CTRLA_CPOL_Pos             _U_(29)                                              /**< (SERCOM_SPI_CTRLA) Clock Polarity Position */
#define SERCOM_SPI_CTRLA_CPOL_Msk             (_U_(0x1) << SERCOM_SPI_CTRLA_CPOL_Pos)              /**< (SERCOM_SPI_CTRLA) Clock Polarity Mask */
#define SERCOM_SPI_CTRLA_CPOL(value)          (SERCOM_SPI_CTRLA_CPOL_Msk & ((value) << SERCOM_SPI_CTRLA_CPOL_Pos))
#define SERCOM_SPI_CTRLA_DORD_Pos             _U_(30)                                              /**< (SERCOM_SPI_CTRLA) Data Order Position */
#define SERCOM_SPI_CTRLA_DORD_Msk             (_U_(0x1) << SERCOM_SPI_CTRLA_DORD_Pos)              /**< (SERCOM_SPI_CTRLA) Data Order Mask */
#define SERCOM_SPI_CTRLA_DORD(value)          (SERCOM_SPI_CTRLA_DORD_Msk & ((value) << SERCOM_SPI_CTRLA_DORD_Pos))
#define SERCOM_SPI_CTRLA_Msk                  _U_(0x7F33019F)                                      /**< (SERCOM_SPI_CTRLA) Register Mask  */


/* -------- SERCOM_USART_CTRLA : (SERCOM Offset: 0x00) (R/W 32) USART Control A -------- */
#define SERCOM_USART_CTRLA_RESETVALUE         _U_(0x00)                                            /**<  (SERCOM_USART_CTRLA) USART Control A  Reset Value */

#define SERCOM_USART_CTRLA_SWRST_Pos          _U_(0)                                               /**< (SERCOM_USART_CTRLA) Software Reset Position */
#define SERCOM_USART_CTRLA_SWRST_Msk          (_U_(0x1) << SERCOM_USART_CTRLA_SWRST_Pos)           /**< (SERCOM_USART_CTRLA) Software Reset Mask */
#define SERCOM_USART_CTRLA_SWRST(value)       (SERCOM_USART_CTRLA_SWRST_Msk & ((value) << SERCOM_USART_CTRLA_SWRST_Pos))
#define SERCOM_USART_CTRLA_ENABLE_Pos         _U_(1)                                               /**< (SERCOM_USART_CTRLA) Enable Position */
#define SERCOM_USART_CTRLA_ENABLE_Msk         (_U_(0x1) << SERCOM_USART_CTRLA_ENABLE_Pos)          /**< (SERCOM_USART_CTRLA) Enable Mask */
#define SERCOM_USART_CTRLA_ENABLE(value)      (SERCOM_USART_CTRLA_ENABLE_Msk & ((value) << SERCOM_USART_CTRLA_ENABLE_Pos))
#define SERCOM_USART_CTRLA_MODE_Pos           _U_(2)                                               /**< (SERCOM_USART_CTRLA) Operating Mode Position */
#define SERCOM_USART_CTRLA_MODE_Msk           (_U_(0x7) << SERCOM_USART_CTRLA_MODE_Pos)            /**< (SERCOM_USART_CTRLA) Operating Mode Mask */
#define SERCOM_USART_CTRLA_MODE(value)        (SERCOM_USART_CTRLA_MODE_Msk & ((value) << SERCOM_USART_CTRLA_MODE_Pos))
#define   SERCOM_USART_CTRLA_MODE_USART_EXT_CLK_Val _U_(0x0)                                             /**< (SERCOM_USART_CTRLA) USART mode with external clock  */
#define   SERCOM_USART_CTRLA_MODE_USART_INT_CLK_Val _U_(0x1)                                             /**< (SERCOM_USART_CTRLA) USART mode with internal clock  */
#define   SERCOM_USART_CTRLA_MODE_SPI_SLAVE_Val _U_(0x2)                                             /**< (SERCOM_USART_CTRLA) SPI mode with external clock  */
#define   SERCOM_USART_CTRLA_MODE_SPI_MASTER_Val _U_(0x3)                                             /**< (SERCOM_USART_CTRLA) SPI mode with internal clock  */
#define   SERCOM_USART_CTRLA_MODE_I2C_SLAVE_Val _U_(0x4)                                             /**< (SERCOM_USART_CTRLA) I2C mode with external clock  */
#define   SERCOM_USART_CTRLA_MODE_I2C_MASTER_Val _U_(0x5)                                             /**< (SERCOM_USART_CTRLA) I2C mode with internal clock  */
#define SERCOM_USART_CTRLA_MODE_USART_EXT_CLK (SERCOM_USART_CTRLA_MODE_USART_EXT_CLK_Val << SERCOM_USART_CTRLA_MODE_Pos) /**< (SERCOM_USART_CTRLA) USART mode with external clock Position  */
#define SERCOM_USART_CTRLA_MODE_USART_INT_CLK (SERCOM_USART_CTRLA_MODE_USART_INT_CLK_Val << SERCOM_USART_CTRLA_MODE_Pos) /**< (SERCOM_USART_CTRLA) USART mode with internal clock Position  */
#define SERCOM_USART_CTRLA_MODE_SPI_SLAVE     (SERCOM_USART_CTRLA_MODE_SPI_SLAVE_Val << SERCOM_USART_CTRLA_MODE_Pos) /**< (SERCOM_USART_CTRLA) SPI mode with external clock Position  */
#define SERCOM_USART_CTRLA_MODE_SPI_MASTER    (SERCOM_USART_CTRLA_MODE_SPI_MASTER_Val << SERCOM_USART_CTRLA_MODE_Pos) /**< (SERCOM_USART_CTRLA) SPI mode with internal clock Position  */
#define SERCOM_USART_CTRLA_MODE_I2C_SLAVE     (SERCOM_USART_CTRLA_MODE_I2C_SLAVE_Val << SERCOM_USART_CTRLA_MODE_Pos) /**< (SERCOM_USART_CTRLA) I2C mode with external clock Position  */
#define SERCOM_USART_CTRLA_MODE_I2C_MASTER    (SERCOM_USART_CTRLA_MODE_I2C_MASTER_Val << SERCOM_USART_CTRLA_MODE_Pos) /**< (SERCOM_USART_CTRLA) I2C mode with internal clock Position  */
#define SERCOM_USART_CTRLA_RUNSTDBY_Pos       _U_(7)                                               /**< (SERCOM_USART_CTRLA) Run during Standby Position */
#define SERCOM_USART_CTRLA_RUNSTDBY_Msk       (_U_(0x1) << SERCOM_USART_CTRLA_RUNSTDBY_Pos)        /**< (SERCOM_USART_CTRLA) Run during Standby Mask */
#define SERCOM_USART_CTRLA_RUNSTDBY(value)    (SERCOM_USART_CTRLA_RUNSTDBY_Msk & ((value) << SERCOM_USART_CTRLA_RUNSTDBY_Pos))
#define SERCOM_USART_CTRLA_IBON_Pos           _U_(8)                                               /**< (SERCOM_USART_CTRLA) Immediate Buffer Overflow Notification Position */
#define SERCOM_USART_CTRLA_IBON_Msk           (_U_(0x1) << SERCOM_USART_CTRLA_IBON_Pos)            /**< (SERCOM_USART_CTRLA) Immediate Buffer Overflow Notification Mask */
#define SERCOM_USART_CTRLA_IBON(value)        (SERCOM_USART_CTRLA_IBON_Msk & ((value) << SERCOM_USART_CTRLA_IBON_Pos))
#define SERCOM_USART_CTRLA_SAMPR_Pos          _U_(13)                                              /**< (SERCOM_USART_CTRLA) Sample Position */
#define SERCOM_USART_CTRLA_SAMPR_Msk          (_U_(0x7) << SERCOM_USART_CTRLA_SAMPR_Pos)           /**< (SERCOM_USART_CTRLA) Sample Mask */
#define SERCOM_USART_CTRLA_SAMPR(value)       (SERCOM_USART_CTRLA_SAMPR_Msk & ((value) << SERCOM_USART_CTRLA_SAMPR_Pos))
#define SERCOM_USART_CTRLA_TXPO_Pos           _U_(16)                                              /**< (SERCOM_USART_CTRLA) Transmit Data Pinout Position */
#define SERCOM_USART_CTRLA_TXPO_Msk           (_U_(0x3) << SERCOM_USART_CTRLA_TXPO_Pos)            /**< (SERCOM_USART_CTRLA) Transmit Data Pinout Mask */
#define SERCOM_USART_CTRLA_TXPO(value)        (SERCOM_USART_CTRLA_TXPO_Msk & ((value) << SERCOM_USART_CTRLA_TXPO_Pos))
#define SERCOM_USART_CTRLA_RXPO_Pos           _U_(20)                                              /**< (SERCOM_USART_CTRLA) Receive Data Pinout Position */
#define SERCOM_USART_CTRLA_RXPO_Msk           (_U_(0x3) << SERCOM_USART_CTRLA_RXPO_Pos)            /**< (SERCOM_USART_CTRLA) Receive Data Pinout Mask */
#define SERCOM_USART_CTRLA_RXPO(value)        (SERCOM_USART_CTRLA_RXPO_Msk & ((value) << SERCOM_USART_CTRLA_RXPO_Pos))
#define SERCOM_USART_CTRLA_SAMPA_Pos          _U_(22)                                              /**< (SERCOM_USART_CTRLA) Sample Adjustment Position */
#define SERCOM_USART_CTRLA_SAMPA_Msk          (_U_(0x3) << SERCOM_USART_CTRLA_SAMPA_Pos)           /**< (SERCOM_USART_CTRLA) Sample Adjustment Mask */
#define SERCOM_USART_CTRLA_SAMPA(value)       (SERCOM_USART_CTRLA_SAMPA_Msk & ((value) << SERCOM_USART_CTRLA_SAMPA_Pos))
#define SERCOM_USART_CTRLA_FORM_Pos           _U_(24)                                              /**< (SERCOM_USART_CTRLA) Frame Format Position */
#define SERCOM_USART_CTRLA_FORM_Msk           (_U_(0xF) << SERCOM_USART_CTRLA_FORM_Pos)            /**< (SERCOM_USART_CTRLA) Frame Format Mask */
#define SERCOM_USART_CTRLA_FORM(value)        (SERCOM_USART_CTRLA_FORM_Msk & ((value) << SERCOM_USART_CTRLA_FORM_Pos))
#define SERCOM_USART_CTRLA_CMODE_Pos          _U_(28)                                              /**< (SERCOM_USART_CTRLA) Communication Mode Position */
#define SERCOM_USART_CTRLA_CMODE_Msk          (_U_(0x1) << SERCOM_USART_CTRLA_CMODE_Pos)           /**< (SERCOM_USART_CTRLA) Communication Mode Mask */
#define SERCOM_USART_CTRLA_CMODE(value)       (SERCOM_USART_CTRLA_CMODE_Msk & ((value) << SERCOM_USART_CTRLA_CMODE_Pos))
#define SERCOM_USART_CTRLA_CPOL_Pos           _U_(29)                                              /**< (SERCOM_USART_CTRLA) Clock Polarity Position */
#define SERCOM_USART_CTRLA_CPOL_Msk           (_U_(0x1) << SERCOM_USART_CTRLA_CPOL_Pos)            /**< (SERCOM_USART_CTRLA) Clock Polarity Mask */
#define SERCOM_USART_CTRLA_CPOL(value)        (SERCOM_USART_CTRLA_CPOL_Msk & ((value) << SERCOM_USART_CTRLA_CPOL_Pos))
#define SERCOM_USART_CTRLA_DORD_Pos           _U_(30)                                              /**< (SERCOM_USART_CTRLA) Data Order Position */
#define SERCOM_USART_CTRLA_DORD_Msk           (_U_(0x1) << SERCOM_USART_CTRLA_DORD_Pos)            /**< (SERCOM_USART_CTRLA) Data Order Mask */
#define SERCOM_USART_CTRLA_DORD(value)        (SERCOM_USART_CTRLA_DORD_Msk & ((value) << SERCOM_USART_CTRLA_DORD_Pos))
#define SERCOM_USART_CTRLA_Msk                _U_(0x7FF3E19F)                                      /**< (SERCOM_USART_CTRLA) Register Mask  */


